Revit 2027 API
Connector.MEPSystem Property
The system of the connector belong to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSystem MEPSystem { get; }
Public ReadOnly Property MEPSystem As MEPSystem
	Get
public:
property MEPSystem^ MEPSystem {
	MEPSystem^ get ();
}
member MEPSystem : MEPSystem with get
Property Value
MEPSystem
Exceptions
Exception | Condition
InvalidOperationException |  Thrown on failure to get system.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace